aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/include/cy_canfd.h
/** FD Format type */
typedef enum
{
    CY_CANFD_FDF_STANDARD_FRAME             = 0x00u, /**< The standard frame format */
    CY_CANFD_FDF_CAN_FD_FRAME               = 0x01u  /**< The CAN FD frame format (new DLC-coding and CRC) */
}cy_en_canfd_fdf_t;

/** Accepted Non-matching Frame type */
typedef enum
{
    CY_CANFD_ANMF_MATCH_FILTER              = 0x00u, /**< The received frame matching filter index FIDX */
    CY_CANFD_ANMF_NOT_MATCH_FILTER          = 0x01u  /**< The received frame did not match any Rx filter element */
}cy_en_canfd_anmf_t;

/** Standard Filter Element Configuration type */
typedef enum
{
    CY_CANFD_SFEC_DISABLE                   = 0x00u, /**< Disable the filter element */
    CY_CANFD_SFEC_STORE_RX_FIFO_0           = 0x01u, /**< Store in Rx FIFO 0 if the filter matches */
    CY_CANFD_SFEC_STORE_RX_FIFO_1           = 0x02u, /**< Store in Rx FIFO 1 if the filter matches */
    CY_CANFD_SFEC_REJECT_ID                 = 0x03u, /**< Reject ID if the filter matches */
    CY_CANFD_SFEC_SET_PRIORITY              = 0x04u, /**< Set priority if the filter matches */
    CY_CANFD_SFEC_SET_PRIORITY_STORE_FIFO_0 = 0x05u, /**< Set priority and store in FIFO 0 if the filter matches */
    CY_CANFD_SFEC_SET_PRIORITY_STORE_FIFO_1 = 0x06u, /**< Set priority and store in FIFO 1 if filter matches */
    CY_CANFD_SFEC_STORE_RX_BUFFER           = 0x07u  /**< Store into Rx Buffer or as debug message,
                                                      * configuration of SFT[1:0] ignored
                                                      */
}cy_en_canfd_sfec_t;

/** Standard Filter Type */
typedef enum
{
    CY_CANFD_SFT_RANGE_SFID1_SFID2          = 0x00u, /**< The range filter from SFID1 to SFID2 (SFID2 >= SFID1) */
    CY_CANFD_SFT_DUAL_ID                    = 0x01u, /**< The Dual ID filter for SFID1 or SFID2 */
    CY_CANFD_SFT_CLASSIC_FILTER             = 0x02u, /**< The Classic filter: SFID1 = filter, SFID2 = mask */
    CY_CANFD_SFT_DISABLED                   = 0x03u  /**< The Filter element disabled */
}cy_en_canfd_sft_t;

/** Extended Filter Element Configuration type */
typedef enum
{
    CY_CANFD_EFEC_DISABLE                   = 0x00u, /**< Disable the filter element */
    CY_CANFD_EFEC_STORE_RX_FIFO_0           = 0x01u, /**< Store in Rx FIFO 0 if the filter matches */
    CY_CANFD_EFEC_STORE_RX_FIFO_1           = 0x02u, /**< Store in Rx FIFO 1 if the filter matches */
    CY_CANFD_EFEC_REJECT_ID                 = 0x03u, /**< Reject ID if the filter matches */
    CY_CANFD_EFEC_SET_PRIORITY              = 0x04u, /**< Set priority if the filter matches */
    CY_CANFD_EFEC_SET_PRIORITY_STORE_FIFO_0 = 0x05u, /**< Set priority and store in FIFO 0 if the filter matches */
    CY_CANFD_EFEC_SET_PRIORITY_STORE_FIFO_1 = 0x06u, /**< Set priority and store in FIFO 1 if filter matches */
    CY_CANFD_EFEC_STORE_RX_BUFFER           = 0x07u  /**< Store into Rx Buffer or as debug message,
                                                      * configuration of EFT[1:0] ignored
                                                      */
}cy_en_canfd_efec_t;

/** Extended Filter Type */
typedef enum
{
    CY_CANFD_EFT_RANGE_EFID1_EFID2          = 0x00u, /**< The range filter from EFID1 to EFID2 (EFID2 >= EFID1) */
    CY_CANFD_EFT_DUAL_ID                    = 0x01u, /**< The Dual ID filter for EFID1 or EFID2 */
    CY_CANFD_EFT_CLASSIC_FILTER             = 0x02u, /**< The Classic filter: EFID1 = filter, EFID2 = mask */
    CY_CANFD_EFT_RANGE_EFID1_EFID2_NO_MSK   = 0x03u  /**< The range filter from EFID1 to EFID2 (EFID2 >= EFID1), XIDAM mask not applied */
}cy_en_canfd_eft_t;

/** Test Mode Type */
typedef enum
{
    CY_CANFD_TEST_MODE_DISABLE              = 0x00u, /**< The normal operation. Test Mode is disabled */
    CY_CANFD_TEST_MODE_BUS_MONITORING       = 0x01u, /**< The Bus Monitoring Mode */
    CY_CANFD_TEST_MODE_EXTERNAL_LOOP_BACK   = 0x02u, /**< The External Loop Back Mode */
    CY_CANFD_TEST_MODE_INTERNAL_LOOP_BACK   = 0x03u  /**< The Internal Loop Back Mode */
}cy_stc_canfd_test_mode_t;

/** Last Error Code and Data Phase Last Error Code Type. \n
*   Used with Cy_CANFD_GetLastError() for LEC and DLEC fields of the
*   Protocol Status Register.
*/
typedef enum
{
    CY_CANFD_LEC_NO_ERROR    = 0x00u, /**< No error occurred since LEC was reset
                                       * by successful reception or transmission.
                                       */
    CY_CANFD_LEC_STUFF_ERROR = 0x01u, /**< More than 5 equal bits in a sequence
                                       * occurred in a part of a received message
                                       */
    CY_CANFD_LEC_FORM_ERROR  = 0x02u, /**< A fixed format part of a received frame
                                       * has the wrong format
                                       */
    CY_CANFD_LEC_ACK_ERROR   = 0x03u, /**< The message this CAN FD Core transmitted
                                       * was not acknowledged by another node
                                       */
    CY_CANFD_LEC_BIT1_ERROR  = 0x04u, /**< While trying to send a recessive bit (1)
                                       * a dominant level (0) was sampled
                                       */
    CY_CANFD_LEC_BIT0_ERROR  = 0x05u, /**< While trying to send a dominant bit (0)
                                       * a recessive level (1) was sampled
                                       */
    CY_CANFD_LEC_CRC_ERROR   = 0x06u, /**< The CRC checksum was incorrect */
    CY_CANFD_LEC_NO_CHANGE   = 0x07u  /**< No CAN bus event was detected since the
                                       * last CPU read access to the Protocol
                                       * Status Register
                                       */
}cy_en_canfd_LEC_t;

/** Bus Activity State field of the PSR
*   Used with Cy_CANFD_GetLastError() for ACT field of the
*   Protocol Status Register. */
typedef enum
{
    CY_CANFD_PSR_ACT_SYNC = 0x00u, /**< The node is synchronizing on CAN communication */
    CY_CANFD_PSR_ACT_IDLE = 0x01u, /**< The node is neither receiver nor transmitter */
    CY_CANFD_PSR_ACT_RX   = 0x02u, /**< The node is operating as receiver */
    CY_CANFD_PSR_ACT_TX   = 0x03u  /**< The node is operating as transmitter */
}cy_en_canfd_PSR_ACT_t;

