aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/include/cy_canfd.h
/** \} group_canfd_enums */

/** \cond PARAM_CHECK_MACROS */

#define CY_CANFD_CHANNEL_MAX_CNT                    (8U)
#define CY_CANFD_IS_CHANNEL_VALID(id)               ((CY_CANFD_CHANNEL_MAX_CNT - 1U) >= (id))
#define CY_CANFD_IS_CHS_MASK_VALID(channels)        (0U == ((channels) & (uint32_t)~CANFD_CTL_STOP_REQ_Msk))
#define CY_CANFD_NOM_PRESCALER_MAX                  (511U)
#define CY_CANFD_IS_NOM_PRESCALER_VALID(nbrp)       ((CY_CANFD_NOM_PRESCALER_MAX) >= (nbrp))
#define CY_CANFD_IS_NOM_TIME_SEG_1_VALID(ntseg1)    (0U < (ntseg1))
#define CY_CANFD_NOM_TIME_SEG_2_MAX                 (127U)
#define CY_CANFD_IS_NOM_TIME_SEG_2_VALID(ntseg2)    (((CY_CANFD_NOM_TIME_SEG_2_MAX) >= (ntseg2)) && (0U < (ntseg2)))
#define CY_CANFD_NOM_SYNC_JUMP_WIDTH_MAX            (127U)
#define CY_CANFD_IS_NOM_SYNC_JUMP_WIDTH_VALID(nsjw) ((CY_CANFD_NOM_SYNC_JUMP_WIDTH_MAX) >= (nsjw))
#define CY_CANFD_DAT_PRESCALER_MAX                  (31U)
#define CY_CANFD_IS_DAT_PRESCALER_VALID(dbrp)       ((CY_CANFD_DAT_PRESCALER_MAX) >= (dbrp))
#define CY_CANFD_DAT_TIME_SEG_1_MAX                 (31U)
#define CY_CANFD_IS_DAT_TIME_SEG_1_VALID(dtseg1)    ((CY_CANFD_DAT_TIME_SEG_1_MAX) >= (dtseg1))
#define CY_CANFD_DAT_TIME_SEG_2_MAX                 (15U)
#define CY_CANFD_IS_DAT_TIME_SEG_2_VALID(dtseg2)    ((CY_CANFD_DAT_TIME_SEG_2_MAX) >= (dtseg2))
#define CY_CANFD_DAT_SYNC_JUMP_WIDTH_MAX            (15)
#define CY_CANFD_IS_DAT_SYNC_JUMP_WIDTH_VALID(dsjw) ((CY_CANFD_DAT_SYNC_JUMP_WIDTH_MAX) >= (dsjw))
#define CY_CANFD_IS_ILE_MASK_VALID(intmsk)             (0U == ((intmsk) & (uint32_t)~(CANFD_CH_M_TTCAN_ILE_EINT0_Msk |\
                                                                                CANFD_CH_M_TTCAN_ILE_EINT1_Msk)))
#define CY_CANFD_TDCO_MAX                           (0x7FU)
#define CY_CANFD_IS_TDCO_VALID(tdco)                ((CY_CANFD_TDCO_MAX) >= (tdco))
#define CY_CANFD_TDCF_MAX                           (0x7FU)
#define CY_CANFD_IS_TDCF_VALID(tdcf)                ((CY_CANFD_TDCF_MAX) >= (tdcf))
#define CY_CANFD_SID_FILTERS_MAX_CNT                (128U)
#define CY_CANFD_IS_SID_FILTERS_VALID(num)          ((CY_CANFD_SID_FILTERS_MAX_CNT) >= (num))
#define CY_CANFD_XID_FILTERS_MAX_CNT                (64U)
#define CY_CANFD_IS_XID_FILTERS_VALID(num)          ((CY_CANFD_XID_FILTERS_MAX_CNT) >= (num))
#define CY_CANFD_SFID_MAX                           (0x7FFU)
#define CY_CANFD_IS_SFID_VALID(sfid)                ((CY_CANFD_SFID_MAX) >= (sfid))
#define CY_CANFD_IS_SFEC_VALID(sfec)                ((CY_CANFD_SFEC_DISABLE == (sfec)) || \
                                                     (CY_CANFD_SFEC_STORE_RX_FIFO_0 == (sfec)) || \
                                                     (CY_CANFD_SFEC_STORE_RX_FIFO_1 == (sfec)) || \
                                                     (CY_CANFD_SFEC_REJECT_ID == (sfec)) || \
                                                     (CY_CANFD_SFEC_SET_PRIORITY == (sfec)) || \
                                                     (CY_CANFD_SFEC_SET_PRIORITY_STORE_FIFO_0 == (sfec)) || \
                                                     (CY_CANFD_SFEC_SET_PRIORITY_STORE_FIFO_1 == (sfec)) || \
                                                     (CY_CANFD_SFEC_STORE_RX_BUFFER == (sfec)))
#define CY_CANFD_IS_SFT_VALID(sft)                  ((CY_CANFD_SFT_RANGE_SFID1_SFID2 == (sft)) || \
                                                     (CY_CANFD_SFT_DUAL_ID == (sft)) || \
                                                     (CY_CANFD_SFT_CLASSIC_FILTER == (sft)) || \
                                                     (CY_CANFD_SFT_DISABLED == (sft)))
#define CY_CANFD_EFID_MAX                           (0x1FFFFFFFUL)
#define CY_CANFD_IS_EFID_VALID(efid)                ((CY_CANFD_EFID_MAX) >= (efid))
#define CY_CANFD_IS_EFEC_VALID(efec)                ((CY_CANFD_EFEC_DISABLE == (efec)) || \
                                                     (CY_CANFD_EFEC_STORE_RX_FIFO_0 == (efec)) || \
                                                     (CY_CANFD_EFEC_STORE_RX_FIFO_1 == (efec)) || \
                                                     (CY_CANFD_EFEC_REJECT_ID == (efec)) || \
                                                     (CY_CANFD_EFEC_SET_PRIORITY == (efec)) || \
                                                     (CY_CANFD_EFEC_SET_PRIORITY_STORE_FIFO_0 == (efec)) || \
                                                     (CY_CANFD_EFEC_SET_PRIORITY_STORE_FIFO_1 == (efec)) || \
                                                     (CY_CANFD_EFEC_STORE_RX_BUFFER == (efec)))
#define CY_CANFD_IS_EFT_VALID(eft)                  ((CY_CANFD_EFT_RANGE_EFID1_EFID2 == (eft)) || \
                                                     (CY_CANFD_EFT_DUAL_ID == (eft)) || \
                                                     (CY_CANFD_EFT_CLASSIC_FILTER == (eft)) || \
                                                     (CY_CANFD_EFT_RANGE_EFID1_EFID2_NO_MSK == (eft)))

#define CY_CANFD_IS_ACCEPT_MATCHING_VALID(match)    ((CY_CANFD_ACCEPT_IN_RXFIFO_0 == (match)) || \
                                                     (CY_CANFD_ACCEPT_IN_RXFIFO_1 == (match)) || \
                                                     (CY_CANFD_REJECT_NON_MATCHING == (match)))

#define CY_CANFD_IS_BUF_DATA_SIZE_VALID(size, mode) ((mode) ? \
                                                     ((CY_CANFD_BUFFER_DATA_SIZE_8 == (size)) || \
                                                      (CY_CANFD_BUFFER_DATA_SIZE_12 == (size)) || \
                                                      (CY_CANFD_BUFFER_DATA_SIZE_16 == (size)) || \
                                                      (CY_CANFD_BUFFER_DATA_SIZE_20 == (size)) || \
                                                      (CY_CANFD_BUFFER_DATA_SIZE_24 == (size)) || \
                                                      (CY_CANFD_BUFFER_DATA_SIZE_32 == (size)) || \
                                                      (CY_CANFD_BUFFER_DATA_SIZE_48 == (size)) || \
                                                      (CY_CANFD_BUFFER_DATA_SIZE_64 == (size))) : \
                                                      (CY_CANFD_BUFFER_DATA_SIZE_8 == (size)))

#define CY_CANFD_IS_FIFO_MODE_VALID(mode)           ((CY_CANFD_FIFO_MODE_BLOCKING == (mode)) || \
                                                     (CY_CANFD_FIFO_MODE_OVERWRITE == (mode)))

